# ExtElemChangeBeamSectionRegistry Class

---
An object that stores IExtElemChangeBeamSection
SystemObject Autodesk.Revit.DB.StructureExtElemChangeBeamSectionRegistry
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class ExtElemChangeBeamSectionRegistry : IDisposable

    Public Class ExtElemChangeBeamSectionRegistry
    	Implements IDisposable

    public ref class ExtElemChangeBeamSectionRegistry : IDisposable

    type ExtElemChangeBeamSectionRegistry =
        class
            interface IDisposable
        end
The ExtElemChangeBeamSectionRegistry type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the ExtElemChangeBeamSectionRegistry
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| RegisterInterface|  Registers a IExtElemChangeBeamSection
| ToString| Returns a string that represents the current object.(Inherited from Object)
| Unregister|  Unregisters IExtElemChangeBeamSection.
Top
#### Reference
Autodesk.Revit.DB.Structure Namespace